; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p16---int100n150-m25---int100c150---s458---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 - fuellevel
)

(:init
(sum level0 level6 level6)
(sum level0 level16 level16)
(sum level0 level21 level21)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level6 level7)
(sum level1 level16 level17)
(sum level1 level21 level22)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level6 level8)
(sum level2 level16 level18)
(sum level2 level21 level23)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level6 level9)
(sum level3 level16 level19)
(sum level3 level21 level24)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level6 level10)
(sum level4 level16 level20)
(sum level4 level21 level25)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level6 level11)
(sum level5 level16 level21)
(sum level5 level21 level26)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level6 level12)
(sum level6 level16 level22)
(sum level6 level21 level27)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level6 level13)
(sum level7 level16 level23)
(sum level7 level21 level28)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level6 level14)
(sum level8 level16 level24)
(sum level8 level21 level29)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level6 level15)
(sum level9 level16 level25)
(sum level9 level21 level30)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level6 level16)
(sum level10 level16 level26)
(sum level10 level21 level31)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level6 level17)
(sum level11 level16 level27)
(sum level11 level21 level32)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level6 level18)
(sum level12 level16 level28)
(sum level12 level21 level33)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level6 level19)
(sum level13 level16 level29)
(sum level13 level21 level34)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level6 level20)
(sum level14 level16 level30)
(sum level14 level21 level35)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level6 level21)
(sum level15 level16 level31)
(sum level15 level21 level36)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level6 level22)
(sum level16 level16 level32)
(sum level16 level21 level37)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level6 level23)
(sum level17 level16 level33)
(sum level17 level21 level38)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level6 level24)
(sum level18 level16 level34)
(sum level18 level21 level39)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level6 level25)
(sum level19 level16 level35)
(sum level19 level21 level40)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level6 level26)
(sum level20 level16 level36)
(sum level20 level21 level41)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level6 level27)
(sum level21 level16 level37)
(sum level21 level21 level42)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level6 level28)
(sum level22 level16 level38)
(sum level22 level21 level43)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level6 level29)
(sum level23 level16 level39)
(sum level23 level21 level44)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level6 level30)
(sum level24 level16 level40)
(sum level24 level21 level45)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level6 level31)
(sum level25 level16 level41)
(sum level25 level21 level46)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level6 level32)
(sum level26 level16 level42)
(sum level26 level21 level47)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level6 level33)
(sum level27 level16 level43)
(sum level27 level21 level48)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level6 level34)
(sum level28 level16 level44)
(sum level28 level21 level49)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level6 level35)
(sum level29 level16 level45)
(sum level29 level21 level50)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level30 level6 level36)
(sum level30 level16 level46)
(sum level30 level21 level51)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level31 level6 level37)
(sum level31 level16 level47)
(sum level31 level21 level52)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level32 level6 level38)
(sum level32 level16 level48)
(sum level32 level21 level53)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level33 level6 level39)
(sum level33 level16 level49)
(sum level33 level21 level54)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level34 level6 level40)
(sum level34 level16 level50)
(sum level34 level21 level55)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level6 level41)
(sum level35 level16 level51)
(sum level35 level21 level56)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level36 level6 level42)
(sum level36 level16 level52)
(sum level36 level21 level57)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level37 level6 level43)
(sum level37 level16 level53)
(sum level37 level21 level58)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level38 level6 level44)
(sum level38 level16 level54)
(sum level38 level21 level59)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level39 level6 level45)
(sum level39 level16 level55)
(sum level39 level21 level60)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level40 level6 level46)
(sum level40 level16 level56)
(sum level40 level21 level61)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level41 level6 level47)
(sum level41 level16 level57)
(sum level41 level21 level62)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level42 level6 level48)
(sum level42 level16 level58)
(sum level42 level21 level63)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level43 level6 level49)
(sum level43 level16 level59)
(sum level43 level21 level64)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level44 level6 level50)
(sum level44 level16 level60)
(sum level44 level21 level65)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level45 level6 level51)
(sum level45 level16 level61)
(sum level45 level21 level66)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level6 level52)
(sum level46 level16 level62)
(sum level46 level21 level67)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level47 level6 level53)
(sum level47 level16 level63)
(sum level47 level21 level68)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level48 level6 level54)
(sum level48 level16 level64)
(sum level48 level21 level69)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level49 level6 level55)
(sum level49 level16 level65)
(sum level49 level21 level70)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level50 level6 level56)
(sum level50 level16 level66)
(sum level50 level21 level71)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level51 level6 level57)
(sum level51 level16 level67)
(sum level51 level21 level72)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level52 level6 level58)
(sum level52 level16 level68)
(sum level52 level21 level73)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level53 level6 level59)
(sum level53 level16 level69)
(sum level53 level21 level74)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level54 level6 level60)
(sum level54 level16 level70)
(sum level54 level21 level75)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level55 level6 level61)
(sum level55 level16 level71)
(sum level55 level21 level76)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level56 level6 level62)
(sum level56 level16 level72)
(sum level56 level21 level77)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level57 level6 level63)
(sum level57 level16 level73)
(sum level57 level21 level78)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level58 level6 level64)
(sum level58 level16 level74)
(sum level58 level21 level79)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level59 level6 level65)
(sum level59 level16 level75)
(sum level59 level21 level80)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level60 level6 level66)
(sum level60 level16 level76)
(sum level60 level21 level81)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level61 level6 level67)
(sum level61 level16 level77)
(sum level61 level21 level82)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level62 level6 level68)
(sum level62 level16 level78)
(sum level62 level21 level83)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level63 level6 level69)
(sum level63 level16 level79)
(sum level63 level21 level84)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level64 level6 level70)
(sum level64 level16 level80)
(sum level64 level21 level85)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level65 level6 level71)
(sum level65 level16 level81)
(sum level65 level21 level86)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level66 level6 level72)
(sum level66 level16 level82)
(sum level66 level21 level87)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level67 level6 level73)
(sum level67 level16 level83)
(sum level67 level21 level88)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level68 level6 level74)
(sum level68 level16 level84)
(sum level68 level21 level89)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level69 level6 level75)
(sum level69 level16 level85)
(sum level69 level21 level90)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level70 level6 level76)
(sum level70 level16 level86)
(sum level70 level21 level91)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level71 level6 level77)
(sum level71 level16 level87)
(sum level71 level21 level92)
(sum level71 level23 level94)
(sum level71 level24 level95)
(sum level72 level6 level78)
(sum level72 level16 level88)
(sum level72 level21 level93)
(sum level72 level23 level95)
(sum level72 level24 level96)
(sum level73 level6 level79)
(sum level73 level16 level89)
(sum level73 level21 level94)
(sum level73 level23 level96)
(sum level73 level24 level97)
(sum level74 level6 level80)
(sum level74 level16 level90)
(sum level74 level21 level95)
(sum level74 level23 level97)
(sum level74 level24 level98)
(sum level75 level6 level81)
(sum level75 level16 level91)
(sum level75 level21 level96)
(sum level75 level23 level98)
(sum level75 level24 level99)
(sum level76 level6 level82)
(sum level76 level16 level92)
(sum level76 level21 level97)
(sum level76 level23 level99)
(sum level76 level24 level100)
(sum level77 level6 level83)
(sum level77 level16 level93)
(sum level77 level21 level98)
(sum level77 level23 level100)
(sum level77 level24 level101)
(sum level78 level6 level84)
(sum level78 level16 level94)
(sum level78 level21 level99)
(sum level78 level23 level101)
(sum level78 level24 level102)
(sum level79 level6 level85)
(sum level79 level16 level95)
(sum level79 level21 level100)
(sum level79 level23 level102)
(sum level79 level24 level103)
(sum level80 level6 level86)
(sum level80 level16 level96)
(sum level80 level21 level101)
(sum level80 level23 level103)
(sum level80 level24 level104)
(sum level81 level6 level87)
(sum level81 level16 level97)
(sum level81 level21 level102)
(sum level81 level23 level104)
(sum level81 level24 level105)
(sum level82 level6 level88)
(sum level82 level16 level98)
(sum level82 level21 level103)
(sum level82 level23 level105)
(sum level82 level24 level106)
(sum level83 level6 level89)
(sum level83 level16 level99)
(sum level83 level21 level104)
(sum level83 level23 level106)
(sum level83 level24 level107)
(sum level84 level6 level90)
(sum level84 level16 level100)
(sum level84 level21 level105)
(sum level84 level23 level107)
(sum level84 level24 level108)
(sum level85 level6 level91)
(sum level85 level16 level101)
(sum level85 level21 level106)
(sum level85 level23 level108)
(sum level85 level24 level109)
(sum level86 level6 level92)
(sum level86 level16 level102)
(sum level86 level21 level107)
(sum level86 level23 level109)
(sum level86 level24 level110)
(sum level87 level6 level93)
(sum level87 level16 level103)
(sum level87 level21 level108)
(sum level87 level23 level110)
(sum level87 level24 level111)
(sum level88 level6 level94)
(sum level88 level16 level104)
(sum level88 level21 level109)
(sum level88 level23 level111)
(sum level88 level24 level112)
(sum level89 level6 level95)
(sum level89 level16 level105)
(sum level89 level21 level110)
(sum level89 level23 level112)
(sum level90 level6 level96)
(sum level90 level16 level106)
(sum level90 level21 level111)
(sum level91 level6 level97)
(sum level91 level16 level107)
(sum level91 level21 level112)
(sum level92 level6 level98)
(sum level92 level16 level108)
(sum level93 level6 level99)
(sum level93 level16 level109)
(sum level94 level6 level100)
(sum level94 level16 level110)
(sum level95 level6 level101)
(sum level95 level16 level111)
(sum level96 level6 level102)
(sum level96 level16 level112)
(sum level97 level6 level103)
(sum level98 level6 level104)
(sum level99 level6 level105)
(sum level100 level6 level106)
(sum level101 level6 level107)
(sum level102 level6 level108)
(sum level103 level6 level109)
(sum level104 level6 level110)
(sum level105 level6 level111)
(sum level106 level6 level112)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l0 l3)
(fuelcost level23 l0 l3)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l1 l3)
(fuelcost level6 l1 l3)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level21 l2 l1)
(connected l2 l3)
(fuelcost level24 l2 l3)
(connected l3 l0)
(fuelcost level23 l3 l0)
(connected l3 l1)
(fuelcost level6 l3 l1)
(connected l3 l2)
(fuelcost level24 l3 l2)

(at t0 l1)
(fuel t0 level112)
(= (total-cost) 0)

(at p0 l1)
(at p1 l2)
(at p2 l3)
(at p3 l2)
(at p4 l1)
(at p5 l3)
(at p6 l0)
(at p7 l3)
(at p8 l0)
(at p9 l1)
(at p10 l2)
(at p11 l0)
(at p12 l3)
(at p13 l0)
(at p14 l3)
(at p15 l0)
)

(:goal
(and
(at p0 l0)
(at p1 l0)
(at p2 l1)
(at p3 l1)
(at p4 l0)
(at p5 l0)
(at p6 l3)
(at p7 l1)
(at p8 l1)
(at p9 l3)
(at p10 l1)
(at p11 l1)
(at p12 l2)
(at p13 l1)
(at p14 l0)
(at p15 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 16
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 16
3. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 16
4. (drive t0 l1 l3 level106 level6 level112)
   deleted: (at t0 l1) (fuel t0 level112)
   added: (at t0 l3) (fuel t0 level106)
   goals met: 0 of 16
5. (load p7 t0 l3)
   deleted: (at p7 l3)
   added: (in p7 t0)
   goals met: 0 of 16
6. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 0 of 16
7. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 16
8. (load p14 t0 l3)
   deleted: (at p14 l3)
   added: (in p14 t0)
   goals met: 0 of 16
9. (load p12 t0 l3)
   deleted: (at p12 l3)
   added: (in p12 t0)
   goals met: 0 of 16
10. (drive t0 l3 l2 level82 level24 level106)
   deleted: (at t0 l3) (fuel t0 level106)
   added: (at t0 l2) (fuel t0 level82)
   goals met: 0 of 16
11. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 1 of 16
12. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 1 of 16
13. (load p10 t0 l2)
   deleted: (at p10 l2)
   added: (in p10 t0)
   goals met: 1 of 16
14. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 16
15. (drive t0 l2 l0 level66 level16 level82)
   deleted: (at t0 l2) (fuel t0 level82)
   added: (at t0 l0) (fuel t0 level66)
   goals met: 1 of 16
16. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 1 of 16
17. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 1 of 16
18. (load p15 t0 l0)
   deleted: (at p15 l0)
   added: (in p15 t0)
   goals met: 1 of 16
19. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 1 of 16
20. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 1 of 16
21. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 16
22. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 3 of 16
23. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 4 of 16
24. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 5 of 16
25. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 6 of 16
26. (drive t0 l0 l1 level43 level23 level66)
   deleted: (at t0 l0) (fuel t0 level66)
   added: (at t0 l1) (fuel t0 level43)
   goals met: 6 of 16
27. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 7 of 16
28. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 8 of 16
29. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 9 of 16
30. (unload p15 t0 l1)
   deleted: (in p15 t0)
   added: (at p15 l1)
   goals met: 10 of 16
31. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 11 of 16
32. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 12 of 16
33. (unload p7 t0 l1)
   deleted: (in p7 t0)
   added: (at p7 l1)
   goals met: 13 of 16
34. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 14 of 16
35. (drive t0 l1 l3 level37 level6 level43)
   deleted: (at t0 l1) (fuel t0 level43)
   added: (at t0 l3) (fuel t0 level37)
   goals met: 14 of 16
36. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 15 of 16
37. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 16 of 16
